package org.example.lessons.lesson07.homeworks
fun main() {



// Задания для цикла for
// Прямой диапазон
// 1.Напишите цикл for, который выводит числа от 1 до 5.
    for (i in 1..5) {
        println(i)
    }
    println("===1====")
// 2.Напишите цикл for, который выводит четные числа от 1 до 10.
    for (j in 1..10) {if (j % 2 == 0)
        println(j)}
    println("===2====")
// Обратный диапазон
// 3.Создайте цикл for, который выводит числа от 5 до 1.
    for (l in 5 downTo 1) {
        println(l)}
    println("===3====")

// 4.Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
    for (k in 10 downTo 1) {if (k % 2 == 0)
        println(k)}
    println("===4====")

//С шагом (step)
// 5.Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
    for (m in 1..9 step 2) {
        println(m)}
    println("===5====")

// 6.Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
    for (c in 1 ..20 step 3) {
        println(c)}
    println("===6====")

// Использование до (until)
// 7.Создайте числовую переменную 'size'. Используйте цикл for с шагом 2 для вывода
// чисел от 3 до size не включая size.

    var size: Int
    size = 10
    for (f in 3 until size step 2) {
        println(f)}
    println("===7====")


// Задания для цикла while
// Цикл while
// 8. Создайте цикл while, который выводит квадраты чисел от 1 до 5.

    var SquaresNumber = 1
    while(++SquaresNumber <= 5) {
        println(SquaresNumber * SquaresNumber)
    }
    println("===8====")

// 9.Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат
// в консоль
   var counter  = 10
    while(--counter >= 5 ) {
        println(counter)
    }
    println("===9====")
// 10. Цикл do while
//Используйте цикл do while, чтобы вывести числа от 5 до 1.
    var counter1  = 5
    do {
        println(counter1)
    } while (counter1-- >1)

    println("===10====")

// 11.Создайте цикл do while, который повторяется, пока счетчик меньше 10, начиная с 5.
    var counter2 = 5
    do {
        println(counter2)
    } while (counter2 ++ < 10)

    println("===10====")

}
//Задания для прерывания и пропуска итерации
//Использование break
//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
//Использование continue
//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
//Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
//}