package org.example.lessons.lesson10

val emptyMap: Map<String, String> = mapOf<String, String>() // создает пустй словарь и казываем типы ключ и значения
// Словарь, проинициализированный значениями
val capitals = mapOf("Россия" to "Москва", "Франция" to "Париж")
val map = mapOf(1 to "a", 2 to "b", 3 to "c")

// Изменяемые словари (MutableMap)
// Изменяемый словарь MutableMap позволяет добавлять,
// удалять и изменять элементы после его создания.
// индексов нет, но есть ключи

val mutableCapitals = mutableMapOf("Россия" to "Москва", "Франция" to "Париж")

//Добавление и удаление элементов:

fun main() {


    mutableCapitals["Германия"] = "Берлин"
    mutableCapitals.remove("Франция")

// Примеры работы со словарями
// Доступ к элементам:

    val capitalOfRussia = capitals["Россия"]
// Перебор элементов:

    for ((country, capital) in capitals) {
        println("$country: $capital")
    }
// Условия:

    if ("Россия" in capitals) { // проверяет содержится ли такой ключ в...
        println("Столица России: ${capitals["Россия"]}")
    }

//    Ключи в словарях
//    Когда мы работаем со словарями (Map) в Kotlin, важно понимать роль ключей и значений,
//    а также их особенности.

//    Уникальность ключей
//    Ключи в словаре должны быть уникальными. Это означает, что каждый ключ может
//    появляться в словаре только один раз. Если вы попытаетесь добавить в словарь
//    пару ключ-значение, где ключ уже существует, старое значение, ассоциированное
//    с этим ключом, будет перезаписано новым. Это ключевая особенность словарей,
//    которая позволяет эффективно управлять данными:

    val map = mutableMapOf("a" to 1, "b" to 2)
    map["a"] = 3  // значение по ключу "a" теперь будет 3, а не 1

  //1.Создайте пустой неизменяемый словарь, где ключами будут строки, а значениями - целые числа.
}