package org.example.lessons.lesson16

//Полиморфизм в ООП — это принцип, позволяющий одному и тому же имени функции
// (или метода) работать по-разному в зависимости от контекста.
// Это достигается двумя основными способами: перегрузкой и переопределением.
//
//Перегрузка (Overloading): Это когда один и тот же метод может принимать
// разное количество или типы параметров. Например, функция add может
// складывать как два числа, так и объединять две строки.
// Выбор конкретной реализации метода зависит от типов и количества аргументов,
// переданных при вызове.
//
//Переопределение (Overriding): Это когда производный класс изменяет
// реализацию метода, унаследованного от базового класса.
// Так, метод базового класса и его производные классы могут иметь разное
// поведение, несмотря на то что вызывается одно и то же имя метода.
// Это позволяет объектам производных классов реагировать по-разному на одни и
// те же сообщения (вызовы методов).
//
//Вспомним, что метод - это действие. Название метода должно характеризовать
// это действие. Например Монитор. Действие - показывать изображение (show()).
//
//Переопределение. Для разных мониторов способ вывода изображения будет разным,
// но результат действия будет сопоставим между собой.
//
//Перегрузка. Метод show() может принимать разные источники изображения
// (VGA, HDMI, DisplayPort). Для этого в классе монитора будет три метода,
// которые принимают разные типы подключения,
// но выполнять будут сопоставимые между собой действия.

//Переопределение методов
//Представьте оркестр, где каждый музыкальный инструмент играет мелодию
// своим особенным звуком, при этом каждый инструмент выполняет одну и ту
// же функцию - проиграть определённый набор нот.
// Полиморфизм в программировании похож на этот оркестр:
// разные объекты могут использовать один и тот же метод,
// но каждый из них выполняет его по-своему, внося свой уникальный вклад в общее дело.
//
//Переопределение так же называют динамический полиморфизм — это принцип ООП,
// который позволяет объектам разных классов обрабатывать данные с использованием
// одноименных методов, но реализованных по-разному.

//Примеры из Жизни
//Инструменты в Оркестре: Скрипка, виолончель,
// флейта и барабан могут играть ноту "до",
// но звучание у каждого инструмента будет своё.
// Метод playNote("C") будет реализован по-разному для каждого инструмента,
// хотя и выполняет одну и ту же функцию — играть ноту.
//
//Печать Документов: Разные принтеры (лазерные, струйные, матричные) печатают документы.
// Метод printDocument() будет иметь различную реализацию в зависимости от типа принтера,
// но задача одна — напечатать документ.

//Перегрузка методов
//Представьте, что у вас есть базовый рецепт супа, который вы можете адаптировать
// в зависимости от доступных ингредиентов или предпочтений вкуса.
// Вы можете приготовить суп с курицей, грибами или сделать его вегетарианским,
// используя один и тот же основной рецепт, но изменяя или добавляя ингредиенты.
// Перегрузка методов в программировании работает аналогично: один и тот же метод
// может быть "адаптирован" для выполнения работы с различными параметрами.
//
//Перегрузка методов позволяет определить в классе несколько методов с одинаковыми именами,
// но разными списками параметров. Это позволяет методам выполнять похожие или связанные действия,
// используя разные типы или количество данных.