package org.example.lessons.lesson12.homeworks

import org.example.lessons.lesson10.map

fun main() {
// Задачи на приведение коллекции к значению
//1.Проверить, что размер коллекции больше 5 элементов.
    val ex1 = listOf(1, 2, 3, 4, 5, 6)
    println(ex1.size > 5)

//2.Проверить, что коллекция пустая
    println(ex1.isEmpty())

//3.Проверить, что коллекция не пустая
    println(ex1.isNotEmpty())

//4.Взять элемент по индексу или создать значение если индекса не существует
    println(ex1.getOrElse(2) { 15 })

//5.Собрать коллекцию в строку
    println(ex1.joinToString())

//6.Посчитать сумму всех значений
    println(ex1.sum())

//7.Посчитать среднее
    println(ex1.average())

//8.Взять максимальное число
    println(ex1.max())

//9.Взять минимальное число
    println(ex1.min())

//10.Взять первое число или null
    println(ex1.firstOrNull())

//11.Проверить что коллекция содержит элемент
    println(ex1.contains(5))
    println(2 in ex1)

//    Задачи на обработку коллекций
//12.Отфильтровать коллекцию по диапазону 18-30
    val ex12 = listOf(8, 56, 23, 87, 12, 18, 11)
    val filter12 = ex12.filter { it in 18..30 }

//13.Выбрать числа, которые не делятся на 2 и 3 одновременно
    val filter13 = ex12.filterNot { it % 6 == 0 }

//14.Очистить текстовую коллекцию от null элементов
    val ex14 = listOf(8, null, 56, 23, null, 87, 12, 18, 11)
    val nonNillEx14 = ex14.filterNotNull()

//15.Преобразовать текстовую коллекцию в коллекцию длин слов
    val ex15 = listOf("yes", "not")
    val sizeEx15 = ex15.map { it.length }

//16.Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова,
// а значения - длина слов
    val ex16 = setOf("yes")
    val ex16Map = ex16.associate { it.reversed() to it.length }
    println(ex16Map)
//17.Отсортировать список в алфавитном порядке
    val ex17 = listOf("v", "d", "a", "w", "y")
    val sortedEx17 = ex17.sorted()
    println(sortedEx17)
// 18.Взять первые 3 элемента списка
    val firstTakeEX18 = ex17.take(3)
    println(firstTakeEX18)

// 19.Распечатать квадраты элементов списка
    val ex19 = listOf(1, 2, 3, 4, 5, 6)
    println(ex19.map { it * it })

// 20.Группировать список по первой букве слов
    val ex20 = listOf("банан", "клубника", "яблоко", "груша", "гуава", "киви")
    val ex20GroupBy = ex20.groupBy { it.first() }

// 21.Очистить список от дублей
    val ex21 = listOf(1, 1, 2, 3, 4, 4, 5, 6, 6)
    val ex21Distinct = ex21.distinct()
    println(ex21Distinct)

//22.Отсортировать список по убыванию

    val ex22 = listOf(1, 1, 2, 3, 4, 4, 5, 6, 6)
    val ex22Sorted = ex22.sortedDescending()
    println(ex22Sorted)

//23.Взять последние 3 элемента списка
    val ex23 = ex22.takeLast(3)
    println(ex23)

//    Задача 24. Характеристика числовой коллекции
//    Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой
//    коллекции используя конструкцию when
//
//   - Если коллекция пустая - “Пусто”
//   - Если количество элементов меньше пяти - “Короткая”
//   - Если коллекция начинается с 0 - “Стартовая”
//   - Если сумма всех чисел больше 10000 - “Массивная”
//   - Если среднее значение равно 10 - “Сбалансированная”
//   - Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//   - Если максимальное число меньше -10 - “Отрицательная”
//   - Если минимальное число больше 1000 - “Положительная”
//   - Если содержит одновременно числа 3 и 14 - “Пи***тая”
//   - Иначе - “Уникальная”
//   - Вызвать метод с данными, подходящими под каждую из веток

    fun ex24(list: List<Int>): String { //  return возвращает то что произвел when иначе без return when что-то произведет, но забудет и все и возврата не произойдет
        return when {
            list.isEmpty() -> "Пусто"
            list.size < 5 -> "Короткая"
            list.first() == 0 -> "Стартовая"
            list.sum() > 1000 -> "Массивная"
            list.average() == 10.0 -> "Сбалансированная"
            list.joinToString("").length == 20 -> "Клейкая"
            list.max() < -10 -> "Отрицательная"
            list.min() > 1000 -> "Положительная"
            list.contains(3) && list.contains(14) -> "Пи***тая"
            else -> "Уникальная"


        }
    }
    println(ex24(emptyList()))
    println(ex24(listOf(1, 2, 3, 4)))
    println(ex24(listOf(0, 3, 6)))
    println(ex24(listOf(6000, 5000)))
    println(ex24(listOf(10, 10)))
    println(ex24(listOf(12345, 12345, 12345, 12345)))
    println(ex24(listOf(-11, -12, -15)))
    println(ex24(listOf(5000, 2000, 30000)))
    println(ex24(listOf(1, 2, 3, 56, 14)))

//    Задача 25. Анализ учебных оценок
//    Напиши функцию, которая принимает список чисел и возвращает список чисел.
//
//    Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//    Цель:
//    - Отфильтровать удовлетворительные оценки (>=60),
//    - отсортировать оставшиеся по возрастанию и
//    - взять первые 3.
//    Вызывай методы обработки и фильтрации последовательно один из другого,
//    чтобы результат предыдущего метода являлся основой для следующего.

    fun ex25(listEx25: List<Int>): List<Int> {
        return listEx25.filter { it >= 60 }.sorted().take(3)

    }

//    Задача 26. Создание каталога по первой букве
//    Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и
//    значением - списком строк.
//
//    Начальные значения:


//    Цель: Привести все слова в списке к нижнему регистру,
//    сгруппировать в каталог по первой букве используя метод groupBy
    val list = listOf(
        "Стол",
        "табурет",
        "ваза",
        "Кружка",
        "Зеркало",
        "ковер",
        "Шкаф",
        "часы",
        "Люстра",
        "подушка",
        "Картина",
        "столик",
        "Вазон",
        "шторы",
        "Пуф",
        "книга",
        "Фоторамка",
        "светильник",
        "Коврик",
        "вешалка",
        "Подставка",
        "телевизор",
        "Комод",
        "полка",
        "Абажур",
        "диван",
        "Кресло",
        "занавеска",
        "Бра",
        "пепельница",
        "Глобус",
        "статуэтка",
        "Поднос",
        "фигурка",
        "Ключница",
        "плед",
        "Тумба",
        "игрушка",
        "Настенные часы",
        "подсвечник",
        "Журнальный столик",
        "сувенир",
        "Корзина для белья",
        "посуда",
        "Настольная лампа",
        "торшер",
        "Этажерка"
    )
println(ex26(list))
    println(ex27(list))
println(ex28(numbers))
}
    fun ex26(list: List<String>): Map<Char, List<String>> {

        return list
            .map { it.lowercase() } // map - преобразует каждый элемент коллекции в новое значение, it "этот элемент коллекции"
            .groupBy { it.first() }

    }

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение.
// Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
val list = listOf(
    "Стол",
    "табурет",
    "ваза",
    "Кружка",
    "Зеркало",
    "ковер",
    "Шкаф",
    "часы",
    "Люстра",
    "подушка",
    "Картина",
    "столик",
    "Вазон",
    "шторы",
    "Пуф",
    "книга",
    "Фоторамка",
    "светильник",
    "Коврик",
    "вешалка",
    "Подставка",
    "телевизор",
    "Комод",
    "полка",
    "Абажур",
    "диван",
    "Кресло",
    "занавеска",
    "Бра",
    "пепельница",
    "Глобус",
    "статуэтка",
    "Поднос",
    "фигурка",
    "Ключница",
    "плед",
    "Тумба",
    "игрушка",
    "Настенные часы",
    "подсвечник",
    "Журнальный столик",
    "сувенир",
    "Корзина для белья",
    "посуда",
    "Настольная лампа",
    "торшер",
    "Этажерка")

fun ex27(listEx27: List<String>): String {
    val ex27Size = listEx27.map { it.length }.average()
    return "%.2f".format(ex27Size)

}

//Шаблон	Что означает
//"%.2f"	Вещественное число с двумя знаками после запятой
//"%.0f"	Вещественное — без знаков после запятой (целое)
//"%.3f"	Три знака после запятой
//"%d"	Целое число
//"%s"	Строка
// % - начало спецификатора  "Сюда подставь значение"
// .2  Два знака после запятой
// F - вещественное число (float/double)


//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
//Начальные значения:
val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)

fun ex28(number: List<Int>): Map<String, List<Int>> {
    return number
        .distinct()
        .sortedDescending()
        .groupBy { if  (it %2 ==0) "четные" else "нечетные" }
}

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//
//Начальные значения:
val ages = listOf(22, 18, 30, 45, 17, null, 60)
val ag = 18
// и число для проверки возраста, например 18.

//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его,
// либо null если значения не нашлось.

fun ex29(age: List<Int?>, ag:Int): Int? {
    return ages
        .firstOrNull{it!= null && it > ag} // возвращает элемент или null

}