package org.example.lessons.lesson09

// массивы имеют тип Array<Int>
val numbers: Array<Int> = arrayOf(1, 2, 3, 4, 5)
// arrayOf() - это функция которая создает объект типа Array и в него можно сразу записать
// набор элементов, в нашем случае это (1, 2, 3, 4, 5)
// Массив - он упорядочен, это структура которая будет содержать в себе вот эти элементы (1, 2, 3, 4, 5)
// строго в этом порядке, в независимости от того как мы их сюда добавим,к примеру (2, 1, 1, !, 5)
// Массив имеет фиксированный размер если мы его создали в размере пяти элементов
// поменять размерность массива непосредственно в Котлине нельзя

// Есть специализированные функции для создания массивов определенных типов, их много6 нужно
// смотреть функции которые Котлин предлагает

val doubles: DoubleArray = doubleArrayOf(1.1, 2.2, 3.3) // в него сразу зашито что будет
// Array с типом данных

val emptyArray: Array<String> = Array(size = 5) { "" }
// Пустой массив можем создавать, но обязательно указывая его размерность используя -> конструкцию
// создается объект из 5-ти элементов, и эти 5 элементов мы должны чем-то заполнить
// и мы их заполняем пустыми значениями в фигурных скобках, т.е. в фигурных скобках передается функция
// которая будет генерировать, эти самые значения. В этих фигурных скобках может быть какой-то
// произвольный код, вызов ккого-то метода, либо какой-то генератор написан который будет создавать
// какие-то значения строковые и возвращать из этой функции
// Результат будет всегда один, будет создан массив на 5 элементов и все 5 элементов будут заполнены,  которые переданы из фунции

// Массив может быть из null значений
// так как здесь добавлен вопросик, значит это Int null, значит эта ячейка может хранить, как Интовые значения, так и null значения
// Но вместо этого null мы сможем вставить только Int
val emptyNullableArray: Array<Int?> = arrayOfNulls<Int>(size = 5)

// Тип ЛИСТ создаем через функцию listOf и с круглых скобках() передаем набор элементов
//! Если у нас используется функция listOf или мы явно указываем в тип List в теле переменной
// то будет создан не изменяемый список, т.е. у этой переменной readOnlyList не будет методов чтобы добавить какой-то элемент
// или изменить, очистить
val readOnlyList: List<String> = listOf("a", "b", "c")

// Изменяемы ЛИСТ
val mutableList: MutableList<String> = mutableListOf("a", "b", "c")

// Set - множество добавляется неупорядоченное, индексов у множества нет
// элементы внутри множества каким-то методом сортируются, обычно это какой-то алфавитный порядок, либо еще какими-то способами
// Множество оптимизировано чтобы быстрее выполнять поиск элемента внутри множества, выполнять сравнения внутри множеств,
// выполнять объединение внутри множеств
val numberSet: Set<Int> = setOf(5, 2, 3, 4, 5, 5, 5) // в множеста не попадут 5-ки после цифры 4, т.к. уже ест 5-ка в начале
// каждый элемент между с собой связан в виде цепочки, т.е переходим от 5 к 2 и у него спрашиваем что там за элемент после 2
val mutableNumbersSet: MutableSet<Int> = mutableSetOf(1, 2, 3, 4, 5)
// методы для создания ПУСТЫХ МНОЖЕСТВ
val emptySet: Set<Int> = emptySet() // emptySet - метод который создает пустое множество, он аналогичен методы setOf
// он нужен программисту который читает код, в явном виде сообщить что здесь создается объект пустой намеренно
val emptyMutableSet: MutableSet<Int> = mutableSetOf()
// Set используется например есть задача: Отфильтровать список от дубликатов, т,е, мы можем этот список просто преобразовать в Set
// и автоматически все дубликаты будут удалены

// Перебор элементов коллекции
 // Iterable - это такой специальный интерфейс, который предоставляет возможность перебирать элементы коллекции например в цикле

fun main() {
    numbers[0] = 10
    println(numbers.joinToString(separator = ", ")) // -> 10, 2, 3, 4, 5
    mutableList.add("d") // добавляется элемент четвертым -> ("a", "b", "c", "d")
    mutableList.removeAt(index = 0) //удаляет элемент списка по его индексу, т.е. с нулевым индексом будет
    // удален элемент "a" -> остается ("b", "c", "d")
    mutableList[0] = "e" // происходит замена -> ("е", "c", "d")
    mutableNumbersSet.add(6)     // Добавляет элемент
    mutableNumbersSet.remove(element = 1) // Удаляет элемент


    val set = setOf("k", "o", "t", "l", "i", "n")
    for (letter in set) { // in - означает что мы будем брать по очереди каждый элемент
        // множества setOf("k", "o", "t", "l", "i", "n") и помещать в переменную letter
        // фигурные скобки это блок кода, в блок кода выполняется какая-то последовательность которую мы сюда зададим,
        // это может быть одна строка а может быть и десять строк
        println("| $letter |") // ->
        // | k |
        // | o |
        // | t |
        // | l |
        // | i |
        // | n |
    }
    // Пример со списком
    val list = listOf(32, 53,1, -76)
    for (index in list.indices) { // indices [индэцэс] - это такое сво-во которое хранит диапозон индэксов
        //indices возвращает диапозон индексов и в пересенной index эти индексы мы можем перебирать
        // т.е. первый цикл for  пойдет по индексам 0 это 32, 1 это 53, 2 это 1, 3 это -76 в данном случае будет складывать соседние индексы
        if (index == list.lastIndex) { // lastIndex это сво-во которое возвращает последний индекс этого списка т.е. -> 3
            // дальше мы проверяем если текущий индекс равен последнему индексу то выполнит println(list[index] + list[0])
            println(list[index] + list[0])
        } else {  // иначе выполнит это условие ниже
            println(list[index] + list[index + 1])
        }

        // переборов элементов списка
        var index = list.lastIndex
        while (index>= 0) { // пока index>= 0 начинаем с поледнего элемента из-за lastIndex и потом используем дикремент index--
            println("`${list[index--]}`")
            // `-76`
            // `1`
            // `53`
            // `32`
        }
    }

}
