package org.example.lessons.lesson08.homeworks

import org.example.lessons.lesson06.homeworks.example5

//1. Преобразование строк
// Создайте функцию, которая будет анализировать входящие фразы и применять к ним различные
// преобразования, делая текст более ироничным или забавным. Функция должна уметь распознавать
// ключевые слова или условия и соответственно изменять фразу.

// Правила проверки и преобразования:

fun main() {
    example1("Это невозможно выполнить за один день")
    example1("Я не уверен в успехе этого проекта")
    example1("Произошла катастрофа на сервере")
    example1("Этот код работает без проблем")
    example1("Удача")
    example2(log = "Пользователь вошел в систему -> 2021-12-01 09:48:23")
    //example3("4539 1488 0343 6467")
    example4(email = "username@example.com")
    example5(path1 = "C:/Пользователи/Документы/report.txt", path2 = "D:/good.themes/dracula.theme")
//    example6(phrase = "Котлин лучший язык программирования")

}
fun example1(phrase: String) {
    val result = when {
        // Если фраза содержит слово "невозможно":
// Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
        phrase.contains("невозможно") -> phrase.replace(
            "невозможно",
            "совершенно точно возможно, просто требует времени"
        )
        // Если фраза начинается с "Я не уверен":
// Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
        phrase.startsWith("Я не уверен") -> "$phrase, но моя интуиция говорит об обратном"
        // Если фраза содержит слово "катастрофа":
// Преобразование: Замените "катастрофа" на "интересное событие".
        phrase.contains("катастрофа") -> phrase.replace("катастрофа", "интересное событие")
        // Если фраза заканчивается на "без проблем":
// Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
        phrase.endsWith("без проблем") -> phrase.replace("без проблем", "с парой интересных вызовов на пути")
        // Если фраза содержит только одно слово:
// Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".
        phrase.trim().split(" ").size == 1 -> "Иногда, $phrase, но не всегда"
        else -> phrase
    }
    println(result)
}

    // 2. Извлечение даты из строки лога
//  У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23"
//  (данные могут быть любыми, //  но формат всегда такой). Извлеките отдельно дату и время
//  из этой строки и сразу распечатай их по очереди. Используй indexOf или split для получения
//  правой части сообщения.
    fun example2(log: String) {
        val payload = log.split(" -> ")[1]
        val razbivka = payload.split(" ")
        val date = razbivka[0]
        val time = razbivka[1]
        println(date)
        println(time)
    }
// 3. Маскирование личных данных
//Дана строка с номером кредитной карты, например "4539 1488 0343 6467".
// Замаскируйте все цифры, кроме последних четырех, символами "*".
//fun example3(numberCart: String) {
//
//
//}
//4. Форматирование адреса электронной почты.
//У вас есть электронный адрес, например "username@example.com". Преобразуйте его в строку "
// username [at] example [dot] com", используя функцию replace()

fun example4(email: String) {
    val formatted = email.replace("@", "[at]").replace(".", "[dot]")
    println(formatted)
}

// 5. Извлечение имени файла из пути.
// Дан путь к файлу, например "C:/Пользователи/Документы/report.txt" или "D:/good.themes/dracula.theme"
// (может быть любым). Извлеките название файла с расширением.

fun example5(path1: String, path2: String,) {
val fileName1 = path1.substringAfterLast('/')
    val fileName2 = path2.substringAfterLast('/')
    println(fileName1)
    println(fileName2)
}

// 6. Создание аббревиатуры из фразы.
// У вас есть фраза, например "Котлин лучший язык программирования" (может быть любой с разделителями слов - пробел).
// Создайте аббревиатуру из начальных букв слов (например, "ООП").
//Используйте split. Используйте for для перебора слов. Используйте var переменную для накопления первых букв.
//fun example6(phrase: String) {
//val words = phrase.split(" ")
//    var abbreviation = ""
//    for

//}