package org.example.lessons.lesson07

// Задачи для цикла for
// Прямой Диапазон
// Напишите функцию, которая печатает числа от 1 до 10.
// Напишите функцию, которая выводит на экран квадраты чисел от 1 до 5.

fun main() {
//  Прямой Диапазон
//  Напишите функцию, которая печатает числа от 1 до 10.
    for (i in 1..10) {
        println(i)
    }
//    Напишите функцию, которая выводит на экран квадраты чисел от 1 до 5.
for (i in 1..5) {
    println(i * i)
}
//    Создайте функцию, которая выводит все числа от 10 до 1 в обратном порядке.
    for (i in 10 downTo 1) {
        println(i)
    }
    for (i in 1..10) {
        println(11 - i)
}
////    Напишите программу, которая отображает убывающую последовательность четных чисел от
//    20 до 2.

//    for (i in 20 downTo 2) {
//    if (i % 2 == 0) println(i)}
//
////    Цикл с Шагом
//    Реализуйте функцию, выводящую каждое третье число в диапазоне от 1 до 30.

//    for (j in 1..30 step 3) {
//        println(j)
//    }

    //
// Задача: Вывести диапозон индексов(index - это такой способ нумерации элементов от 0 (нуля))
// (нужно задать переменную "интовую" с каким-то числом)
//    Допустим у нас есть коробка в которой лежит 3 кубика, 3 шарика и у каждого шарика есть
////    индекс 0, 1, 2.
//
//    val index: Int = 13
//    for //
}
//
